README.org
#+TITLE: My Literate Linux Desktop
#+STARTUP: overview
#+EXPORT_FILE_NAME: index.html
#+PROPERTIES: header-args :lexical t

* Preliminaries

** Preface

I prefer maximizing control over my system whenever possible. The top priorities for my Linux Desktop include
Accessibility, Ease of Use, Reproducibility, and Stability.

And speaking of control, I've realized I should start documenting my processes. I mean, who knows, my wisdom might just
go six feet under with me, and I've got a boatload of know-how tucked away up in this brain of mine. Plus, you know what
they say about active externalism — it's all about making sure your knowledge doesn't end with you.

** Introduction

I've experimented with different tools over time ranging from shell scripts, makefiles, ansible/puppet/chef
([[https://github.com/Animeshz/linux-desktop/tags][check out the git tags]]) in order to enforce and sync configuration. But as the system evolves, things tend to
deteriorate and everything becomes a giant mess.

Nix appears to tackle these issues, albeit in an extreme manner - less convenient and sensible, but quite effective -
prioritizing correctness over flexibility. Most importantly it guarentees reproducibility, which means I can sit back
and relax; if something worked, it'll keep working unless changed.

Before anything, you can view my configuration at:

- [[https://animeshz.github.io/linux-desktop][Website]]
- [[https://github.com/Animeshz/linux-desktop][GitHub]]

Additionally, I've described nix extensively in [[https://animeshz.github.io/site/notes/20-29--DevEnvironment/21--Linux/21.02-Nix.html][my notes over here]].

* The Base Files

** Pre-Notes

This is prepended to every file tangled from this file,

#+BEGIN_SRC nix :noeval :tangle no
# DON'T EDIT THIS FILE BY HAND!!! This file is controlled by README.org
#+END_SRC

** The flake.nix

This is analogus to =package.json= of some sort for nix, defining the inputs and outputs.

#+BEGIN_SRC nix :noeval :tangle flake.nix
{
  description = "My system configuration";

  inputs = {
    nixpkgs.url = "github:NixOS/nixpkgs/nixpkgs-unstable";
  };

  outputs = inputs: {

  };
}
#+END_SRC

This is then picked by nix comamnd,

#+BEGIN_SRC sh
nix build && ./result/activate
#+END_SRC

#+RESULTS:

* Pog

* References

- [[https://chrishayward.xyz/dotfiles][ChrisHayward's Literate System and Emacs Config]].
