index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-02-29 Thu 12:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>My Literate Linux Desktop</title>
<meta name="author" content="Animesh Sahu" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="preamble" class="status">
<div id="toggle-theme">dark theme</div><div id="toggle-toc">&#9776;</div>
</div>
<div id="content" class="content">
<h1 class="title">My Literate Linux Desktop</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0000006">1. Preliminaries</a>
<ul>
<li><a href="#org0000000">1.1. Preface</a></li>
<li><a href="#org0000003">1.2. Introduction</a></li>
</ul>
</li>
<li><a href="#org000000f">2. The Base Files</a>
<ul>
<li><a href="#org0000009">2.1. Pre-Notes</a></li>
<li><a href="#org000000c">2.2. The flake.nix</a></li>
</ul>
</li>
<li><a href="#org0000012">3. Pog</a></li>
<li><a href="#org0000015">4. References</a></li>
</ul>
</div>
</div>

<div id="outline-container-org0000006" class="outline-2">
<h2 id="org0000006"><span class="section-number-2">1.</span> Preliminaries</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org0000000" class="outline-3">
<h3 id="org0000000"><span class="section-number-3">1.1.</span> Preface</h3>
<div class="outline-text-3" id="text-1-1">
<p>
I prefer maximizing control over my system whenever possible. The top priorities for my Linux Desktop include
Accessibility, Ease of Use, Reproducibility, and Stability.
</p>

<p>
And speaking of control, I've realized I should start documenting my processes. I mean, who knows, my wisdom might just
go six feet under with me, and I've got a boatload of know-how tucked away up in this brain of mine. Plus, you know what
they say about active externalism — it's all about making sure your knowledge doesn't end with you.
</p>
</div>
</div>

<div id="outline-container-org0000003" class="outline-3">
<h3 id="org0000003"><span class="section-number-3">1.2.</span> Introduction</h3>
<div class="outline-text-3" id="text-1-2">
<p>
I've experimented with different tools over time ranging from shell scripts, makefiles, ansible/puppet/chef
(<a href="https://github.com/Animeshz/linux-desktop/tags">check out the git tags</a>) in order to enforce and sync configuration. But as the system evolves, things tend to
deteriorate and everything becomes a giant mess.
</p>

<p>
Nix appears to tackle these issues, albeit in an extreme manner - less convenient and sensible, but quite effective -
prioritizing correctness over flexibility. Most importantly it guarentees reproducibility, which means I can sit back
and relax; if something worked, it'll keep working unless changed.
</p>

<p>
Before anything, you can view my configuration at:
</p>

<ul class="org-ul">
<li><a href="https://animeshz.github.io/linux-desktop">Website</a></li>
<li><a href="https://github.com/Animeshz/linux-desktop">GitHub</a></li>
</ul>

<p>
Additionally, I've described nix extensively in <a href="https://animeshz.github.io/site/notes/20-29--DevEnvironment/21--Linux/21.02-Nix.html">my notes over here</a>.
</p>
</div>
</div>
</div>

<div id="outline-container-org000000f" class="outline-2">
<h2 id="org000000f"><span class="section-number-2">2.</span> The Base Files</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org0000009" class="outline-3">
<h3 id="org0000009"><span class="section-number-3">2.1.</span> Pre-Notes</h3>
<div class="outline-text-3" id="text-2-1">
<p>
This is prepended to every file tangled from this file,
</p>

<div class="org-src-container">
<pre class="src src-nix"><span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);"># </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">DON'T EDIT THIS FILE BY HAND!!! This file is controlled by README.org</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org000000c" class="outline-3">
<h3 id="org000000c"><span class="section-number-3">2.2.</span> The flake.nix</h3>
<div class="outline-text-3" id="text-2-2">
<p>
This is analogus to <code>package.json</code> of some sort for nix, defining the inputs and outputs.
</p>

<div class="org-src-container">
<pre class="src src-nix">{
  <span style="color: #718CA1;">description</span> = <span style="color: var(--clr-string); background-color: var(--bg-string);">"My system configuration"</span>;

  <span style="color: #718CA1;">inputs</span> = {
    <span style="color: #718CA1;">nixpkgs.url</span> = <span style="color: var(--clr-string); background-color: var(--bg-string);">"github:NixOS/nixpkgs/nixpkgs-unstable"</span>;
  };

  <span style="color: #718CA1;">outputs</span> = inputs: {

  };
}
</pre>
</div>

<p>
This is then picked by nix comamnd,
</p>

<div class="org-src-container">
<pre class="src src-sh">nix build &amp;&amp; ./result/activate
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org0000012" class="outline-2">
<h2 id="org0000012"><span class="section-number-2">3.</span> Pog</h2>
</div>

<div id="outline-container-org0000015" class="outline-2">
<h2 id="org0000015"><span class="section-number-2">4.</span> References</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><a href="https://chrishayward.xyz/dotfiles">ChrisHayward's Literate System and Emacs Config</a>.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<script type="text/javascript">
<!--/*--><![CDATA[/*><!--*/
let cookie = document.cookie.split('; ').find(r => r.startsWith('org_html_themify_theme'))
let theme = 'light'

if (cookie) {
  theme = cookie.split('=')[1]
}

let toggleThemeBtn = document.getElementById('toggle-theme')
let toggleTocBtn = document.getElementById('toggle-toc')

if (theme == 'light') {
  useLightTheme();
} else {
  useDarkTheme();
}

function transition() {
  document.body.classList.add('theme-transition')
  setTimeout(() => document.body.classList.remove('theme-transition'), 500)
}

function useLightTheme(theme) {
  document.body.dataset.theme = 'light'
  toggleThemeBtn.innerHTML = 'dark theme'
  document.cookie = 'org_html_themify_theme=light'
}

function useDarkTheme(theme) {
  document.body.dataset.theme = 'dark'
  toggleThemeBtn.innerHTML = 'light theme'
  document.cookie = 'org_html_themify_theme=dark'
}

toggleThemeBtn.addEventListener('click', function() {
  transition()
  if (document.body.dataset.theme == 'light') {
    useDarkTheme();
  } else {
    useLightTheme();
  }
})


let toc = document.getElementById('table-of-contents')

toggleTocBtn.addEventListener('click', function() {
  toc.classList.add('toc-show')
  toc.addEventListener('click', function() {
    toc.classList.remove('toc-show')
  })
})
/*]]>*/-->
</script>
</div>
</body>
</html>
